public/phases/PostRelease.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-07 Wed 18:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Post-Release Roadmap</title>
<meta name="author" content="Dowland Aiello" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../theme/rethink.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Post-Release Roadmap</h1>

<div id="outline-container-org93cc0ec" class="outline-2">
<h2 id="org93cc0ec"><span class="todo TODO">TODO</span> Post-Release <code>[0/5]</code></h2>
<div class="outline-text-2" id="text-org93cc0ec">
<p>
General goals for Vision DAO after its mainnet release, including strategies for decentralizing, and desired partnerships.
</p>

<ul class="org-ul">
<li><i>ETA: Q4 2023</i></li>
</ul>
</div>

<div id="outline-container-org775f660" class="outline-3">
<h3 id="org775f660"><span class="todo TODO">TODO</span> Vision OS Long-Term Support <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-org775f660">
<p>
Post-release, the Vision DAO will be solely responsible for ensuring the security of, and maintaining the Vision Operating System, by patching bugs, and implementing needed features as they arise.
</p>
</div>

<div id="outline-container-orge6b8442" class="outline-4">
<h4 id="orge6b8442"><span class="todo TODO">TODO</span> Market Tools</h4>
<div class="outline-text-4" id="text-orge6b8442">
<p>
Provide utilities for users to leverage market activity across Vision Ideas and Proposals to recognize opportunities in the Vision marketplace, assess risk, and access the most relevant information.
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Trading volume-based search tools</li>
<li class="off"><code>[&#xa0;]</code> Market data integration with decentralized exchange analytics providers, including The Graph</li>
</ul>
</div>
</div>

<div id="outline-container-org47f245c" class="outline-4">
<h4 id="org47f245c"><span class="todo TODO">TODO</span> Blockchain Agnosticism</h4>
<div class="outline-text-4" id="text-org47f245c">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Implement a generalized API for web3 operations, including: executing smart contract code, loading smart contracts payloads, making transactions, and filtering through blockchain statistics. Will allow Vision users to use whatever blockchain they like, if they believe that Ethereum isn't sufficiently "eco-friendly," for example.</li>
<li class="off"><code>[&#xa0;]</code> Implement a generalized p2p networking API for Vision DAO's to communicate between users, and discover information that isn't provided by default modules</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org500ac99" class="outline-3">
<h3 id="org500ac99"><span class="todo TODO">TODO</span> Vision "API" <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-org500ac99">
<p>
Provide hosted, and client-side API's for interfacing with the Vision network. Aim to abstract two main Vision features for use in external applications:
</p>
</div>

<div id="outline-container-org08939a7" class="outline-4">
<h4 id="org08939a7"><span class="todo TODO">TODO</span> Vision ID API</h4>
<div class="outline-text-4" id="text-org08939a7">
<p>
Provide an API that:
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Allows users to carry persistent Vision identities between sites</li>
<li class="off"><code>[&#xa0;]</code> Allows developers to consume users' Vision identities by requesting granular permissions</li>
<li class="off"><code>[&#xa0;]</code> Allow developers to author new Vision ideas from alternate UI's: highlight a comment, and create a Vision Idea; display market information for Ideas of comments on your site; display profile information using Vision</li>
<li class="off"><code>[&#xa0;]</code> Allows users to inject Vision functionality via a browser extension, in relevant places (i.e., previous use cases, but implemented by the user)</li>
</ul>
</div>
</div>

<div id="outline-container-org35d1aa7" class="outline-4">
<h4 id="org35d1aa7"><span class="todo TODO">TODO</span> Vision Storage API</h4>
<div class="outline-text-4" id="text-org35d1aa7">
<p>
Allow third parties to store their data by tokenizing on Vision. Drop-in replacement for Amazon S3.
</p>
</div>
</div>
</div>

<div id="outline-container-org358325f" class="outline-3">
<h3 id="org358325f"><span class="todo TODO">TODO</span> Vision Ideas ETF</h3>
<div class="outline-text-3" id="text-org358325f">
<p>
Implement a DAO on Vision that tracks the top 100 Vision Ideas by marketcap. Similar to an ETF, but for Vision. Allow users to gain exposure to a "basket of assets" on Vision. Generalize to allow derivatives of any number of Vision Ideas to be created, and managed as Vision DAO's.
</p>
</div>
</div>
<div id="outline-container-org20b0e51" class="outline-3">
<h3 id="org20b0e51"><span class="todo TODO">TODO</span> Market Operations <code>[0/3]</code></h3>
<div class="outline-text-3" id="text-org20b0e51">
<p>
To facilitate Vision's function as the "marketplace of ideas," Vision will take on a role as a "market maker," and angel investor for Ideas on vision, providing liquidity by:
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Identifying and executing arbitrage opportunities</li>
<li class="off"><code>[&#xa0;]</code> Identifying valuable investment opportunities through fundamental analysis</li>
<li class="off"><code>[&#xa0;]</code> Doling out grants, and bounties for valuable public works, further decentralizing Vision</li>
</ul>
</div>
</div>
<div id="outline-container-org8642e02" class="outline-3">
<h3 id="org8642e02"><span class="todo TODO">TODO</span> Enterprise Tooling <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-org8642e02">
<p>
The initial phase of Vision's development centers around the Vision Operating System, which provides most of the functionality that the average consumer requires to run a DAO on Vision.  One of Vision DAO's main goals post-release will be to create tools that facilitate enterprise deployments of Vision DAO's.
</p>
</div>

<div id="outline-container-orgd9a0bec" class="outline-4">
<h4 id="orgd9a0bec"><span class="todo TODO">TODO</span> Collaborative Tooling</h4>
<div class="outline-text-4" id="text-orgd9a0bec">
<p>
Vision's collaborative tools present a compelling alternative to existing tools like Slack, and Microsoft Teams. However, Vision's collaborative tools are often used in conjunction with a DAO token model, including a treasury, and other tools. Enterprises that use Vision should be able to opt into these features, and become increasingly DAO-like. For example, enterprises that use Vision's collaborative tools could start out as DAO's that have no treasury, no voting, and use a Vision ID-based authentication system to access collaboration on Vision.
</p>
</div>
</div>

<div id="outline-container-orgb2201db" class="outline-4">
<h4 id="orgb2201db"><span class="todo TODO">TODO</span> Vision "as a service"</h4>
<div class="outline-text-4" id="text-orgb2201db">
<p>
One drawback to cryptocurrency and web3 deployments is that they present variable, and unpredictable costs. This can be especially unappealing for enterprises, who could pay anything from nothing, to thousands of dollars for application deployments, depending on network conditions. To meet this need, Vision will provide hosted "cloud" instances of Vision at reliable costs, pocketing the difference, or footing the bill, between its clients' contract and the gas / pinning fees that it pays.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 06/22/2022</p>
<p class="author">Author: Dowland Aiello</p>
<p class="date">Created: 2022-12-07 Wed 18:12</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
